function talk() {
    var know = {
        "วันเกิดของเกม": "14/07/2544 ยังไงละ!! ",
		"วันเกิดของตัง": "13/10/2543 ยังไงละ!! ",
        "เป็นไงบ้าง": " สบายดีค๊าบ เธอละเป็นไงบ้าง :)",
	    "รักเค้าไหม": " รักค๊าบ รักสุดๆเลย :)",
        "วันที่คบกัน": "17/07/2565 ค๊าบบตัวเธออ",
		"เรื่องราวเริ่มแรก": "เริ่มจากเธอเป็นแกล้งเป็นพี่รหัสเค้า ปลอมตัวแล้วแนบเนียน จนเค้าหลงเชื่อ5555 แล้วก็เริ่มสนิทกัน ห่างหายกันไปแต่ก็ได้กลับมาเจอกันจนได้ ฮิฮิ รักนะค๊าบ จุ๊ฟ",
		"ทำไมถึงทำเว็ปนี้ขึ้นมา": "เค้าไม่รู้ว่า เค้าจะอยู่บนโลกนี้ได้นานไหม 5555 เผื่อวันไหนไม่อยู่เธอจะได่มีเพื่อนคุยนะ เค้าจะพยายามอัพเดทให้เลื่อยๆเลยค๊าบ รักเธอนะ",
        "หนังเรืองแรกที่ไปดูด้วยกัน":
            "เอาจริงๆก็คือ เรื่องแรกที่ไปดูด้วยกันแบบ 2 คน เค้าจำไม่ได้แงง เพราะว่า ไม่ได้ดูหนัง แต่เค้าจำได่ว่าเจอเพื่อนเค้าด้วย ชื่อ เนติ แต่จำชื่อหนังม่ายด้ายยยย ",
    };
    var user = document.getElementById("userBox").value;
    document.getElementById("chatLog").innerHTML = user + "<br>";
    if (user in know)
    {
        document.getElementById("chatLog").innerHTML = know[user] + "<br>";
    }
    else
    {
        document.getElementById("chatLog").innerHTML ="ไม่เข้าใจอ่ะเธออ เอาใหม่ๆ <br>";
    }
}

